Documents/Renault_CRM_ПриемкаАвтомобиля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Renault_CRM_ПриемкаАвтомобиля</Name>
			<BasedOn>
				<xr:Item>Document.Renault_CRM_ЗаявкаНаСервис</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.Renault_ПоврежденияАвтомобилей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ЧерновикиАвтомобилей</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Машиноместо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_ВидыСостоянийДокументовАвтосервиса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеИзменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГосНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьАвтомобиля</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлиентБудетОжидатьОкончаниеРемонта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятБезОсмотра</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохранятьЗамененныеЗЧ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Интерактивная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладалецАвтомобиля</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.CRM_ПотенциальныеКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриемкаИзПланшета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоврежденияАвто</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цвет</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Renault_ЦветаСертификатаКонтроля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИзноса</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РаботаАктуальна</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDРаботы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РекомендуемаяДатаВыполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВыбранныеАкции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Акция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Renault_ЦентрализованныеАкции</v8:Type>
								<v8:Type>cfg:CatalogRef.Renault_АкцииИСкидки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Добавлена</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Renault_ПоврежденияАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ПоврежденияАвтомобилей</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РаботаАктуальна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Renault_ЦветаСертификатаКонтроля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентИзноса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РекомендуемаяДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроизвольноеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_АвтосервисСтатусыРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_АвтосервисСтатусыРабот</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаВремяИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_СтатусыАвторабот</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипПаузы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Renault_АвтосервисВидыПрочейЗанятости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаМойку</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаСервис</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ВыдачаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ПриемкаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_АвтосервисПростой</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_АвтосервисПрочаяЗанятость</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаПодменныйАвто</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_АвтосервисОбед</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_ПодменныеАвто</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_Мойки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Удалить_Авторабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_АвтосервисПланОперативный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_АвтосервисПланОперативный</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДилерскийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ДилерскиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Обращение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ОбращениеВАвтоСервис</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаМойку</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаСервис</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ВыдачаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ПриемкаАвтомобиля</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:DocumentRef.Renault_CRM_ЗаявкаНаПодменныйАвто</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтапРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Цех</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Цеха</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_ПодменныеАвто</v8:Type>
						<v8:Type>cfg:CatalogRef.Renault_CRM_Мойки</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Удалить_Авторабота</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/CRM_ЗанятостьСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>CRM_ЗанятостьСотрудника</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Занят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Свободен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Renault_CRM_ПриемкаАвтомобиля/Ext/ObjectModule.bsl
// Общий журнал

Перем Права Экспорт;

Перем Организация Экспорт;

Функция ПолучитьСписокПечатныхФорм() Экспорт
	Возврат Новый СписокЗначений();
КонецФункции
//Конец необходимых для общих журналов

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Renault_CRM_ЗаявкаНаСервис") Тогда
		VIN = ДанныеЗаполнения.VIN;
		Автомобиль = ДанныеЗаполнения.Автомобиль;
		Клиент = ДанныеЗаполнения.Клиент;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьДокументы(Авто = Неопределено, Клиент = Неопределено)
	
	Обр = Обращение.Ссылка.ПолучитьОбъект();
	
	ГосНомер = "";
	
	Если ЗначениеЗаполнено(Авто) Тогда
		
		ГосНомер = 	Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Авто.Ссылка, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер);
		Обр.Автомобиль = Авто.Ссылка;
		Обр.Записать();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Клиент) Тогда
		
		Обр.Клиент = Клиент.Ссылка;
		Обр.Записать();
		
	КонецЕсли;
	
	Выдача = Документы.Renault_CRM_ВыдачаАвтомобиля.НайтиПоРеквизиту("Обращение", Обр.Ссылка);
	
	Если ЗначениеЗаполнено(Выдача) Тогда
		
		Выдача = Выдача.Ссылка.ПолучитьОбъект();
		
		Если ЗначениеЗаполнено(Авто) Тогда
			
			Выдача.Автомобиль = Авто.Ссылка;
			Выдача.ГосНомер = ГосНомер;
			Выдача.VIN = Авто.VIN;
			Выдача.Записать();
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Клиент) Тогда
			
			Выдача.Клиент = Клиент.Ссылка;
			Выдача.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗапросМойки = Новый Запрос();
	ЗапросМойки.Текст = "ВЫБРАТЬ
	                    |	Renault_CRM_ЗаявкаНаМойку.Ссылка
	                    |ИЗ
	                    |	Документ.Renault_CRM_ЗаявкаНаМойку КАК Renault_CRM_ЗаявкаНаМойку
	                    |ГДЕ
	                    |	Renault_CRM_ЗаявкаНаМойку.Обращение.Ссылка = &Обращение";
	ЗапросМойки.УстановитьПараметр("Обращение", Обр.Ссылка);
	Мойки = ЗапросМойки.Выполнить().Выбрать();
	
	Пока Мойки.Следующий() Цикл
		
		Мойка = Мойки.Ссылка.ПолучитьОбъект();
		
		Если ЗначениеЗаполнено(Авто) Тогда
			
			Мойка.Автомобиль = Авто.Ссылка;
			Мойка.ГосНомер = ГосНомер;
			Мойка.Записать();
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Клиент) Тогда
			
			Мойка.Клиент = Клиент.Ссылка;
			Мойка.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗапросЗаявки = Новый Запрос();
	ЗапросМойки.Текст = "ВЫБРАТЬ
	                    |	Renault_CRM_ЗаявкаНаСервис.Ссылка
	                    |ИЗ
	                    |	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
	                    |ГДЕ
	                    |	Renault_CRM_ЗаявкаНаСервис.Обращение.Ссылка = &Обращение";
	ЗапросЗаявки.УстановитьПараметр("Обращение", Обр.Ссылка);
	Заявки = ЗапросМойки.Выполнить().Выбрать();
	
	Пока Заявки.Следующий() Цикл
		
		Заявка = Заявки.Ссылка.ПолучитьОбъект();
		
		Если ЗначениеЗаполнено(Авто) Тогда
			
			Заявка.ГосНомер = ГосНомер;
			Заявка.VIN = Авто.VIN;
			Заявка.Автомобиль = Авто.Ссылка;
			Заявка.Записать();
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Клиент) Тогда
			
			Заявка.Клиент = Клиент.Ссылка;
			Заявка.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
	Подменка = Документы.Renault_CRM_ЗаявкаНаПодменныйАвто.НайтиПоРеквизиту("Обращение", Обр.Ссылка);
	
	Если ЗначениеЗаполнено(Подменка) Тогда
		
		Подменка = Подменка.Ссылка.ПолучитьОбъект();
		
		Если ЗначениеЗаполнено(Авто) Тогда
			
			Подменка.Автомобиль = Выдача.Ссылка;
			Подменка.ГосНомер = ГосНомер;
			Подменка.Записать();
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Клиент) Тогда
			
			Подменка.Клиент = Клиент.Ссылка;
			Подменка.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)	
	Префикс = DMS_ОбщегоНазначенияСервер.ПолучитьПрефикс();
КонецПроцедуры

Процедура ПриЗаписи(Отказ)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	//#Если Клиент Тогда
	
	Набор = РегистрыСведений.Renault_ПоврежденияАвтомобилей.СоздатьНаборЗаписей();
	Набор.Отбор.Регистратор.Установить(Ссылка);
	Набор.Прочитать();
	Набор.Очистить();
	
	Для Каждого СтрокаРаботы ИЗ ПоврежденияАвто Цикл
		Если ЗначениеЗаполнено(СтрокаРаботы.Работа) И СтрокаРаботы.РаботаАктуальна Тогда
			Запись = Набор.Добавить();
			Запись.Автомобиль = Автомобиль;
			Запись.Работа = СтрокаРаботы.Работа;
			Запись.Период = Дата;
			Запись.Регистратор = Ссылка;
			Запись.РаботаАктуальна = Истина;
			Запись.ПроцентИзноса = СтрокаРаботы.ПроцентИзноса;
			Запись.РекомендуемаяДатаВыполнения = СтрокаРаботы.РекомендуемаяДатаВыполнения;
			Запись.Цвет = СтрокаРаботы.Цвет;
		КонецЕсли;
	КонецЦикла;
	Набор.Записать();
	
	//#КонецЕсли
	
	//Если СостояниеИзменено Тогда
	//	МассивСообщений = Новый Массив;
	//	Если Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.НачатьРаботу
	//		ИЛИ Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.ВРаботе Тогда
	//		Renault_СообщенияПользователю.СоздатьСообщение(Ссылка, Неопределено, МассивСообщений, Справочники.Renault_ВидСообщения.Автосервис_ПриемкаНачата, Неопределено, Неопределено);
	//	ИначеЕсли Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Выполнен Тогда
	//		Renault_СообщенияПользователю.СоздатьСообщение(Ссылка, Неопределено, МассивСообщений, Справочники.Renault_ВидСообщения.Автосервис_ПриемкаОкончена, Неопределено, Неопределено);
	//	КонецЕсли;
	//	
	//КонецЕсли;
	#Если Клиент Тогда
	
	Если ЗначениеЗаполнено(Автомобиль) Тогда
		
		//Если ПараметрыСеанса.Renault_ПраваПользователя.ВерсияАльфаАвто = "4" Тогда
		//	
		//	Попытка
		//		
		//		АвтоОб = Автомобиль.Ссылка.ПолучитьОбъект();
		//		
		//		Выполнить("ГосНомер	 = АвтоОб.ЧтениеЗначенияРегистраСведения(Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер)");
		//		//Пробег		 = АвтоОб.ЧтениеЗначенияРегистраСведения(Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);	
		//		
		//	Исключение
		//		
		//		//Сообщить("Не удалось прочитать данные автомобиля: " + ОписаниеОшибки());
		//		
		//	КонецПопытки;
		//	
		//Иначе
			
			Выполнить("ГосНомер	 = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Автомобиль.Ссылка, Перечисления.ДополнительнаяИнформацияАвтомобилей.ГосНомер)");
			//Пробег		 = Справочники.Автомобили.ЧтениеЗначенияРегистраСведения(Элемент.ТекущиеДанные.Автомобиль, Перечисления.ДополнительнаяИнформацияАвтомобилей.Пробег);
			
		//КонецЕсли;
		
	КонецЕсли;
	
	#КонецЕсли
		
	Если Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Заявка Тогда
		
		
	/// При старте приемки запишем все документы по обращению в регистр "Renault_АвтосервисПланОперативный"
	ИначеЕсли Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.ПриемкаНачата Тогда
		
		// запишем приемку
		
		Запись = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьМенеджерЗаписи();
		Запись.ДилерскийЦентр = ДилерскийЦентр;
		Запись.Обращение = Обращение;
		Запись.Цех = Машиноместо;
		Запись.ЭтапРабот = 1;
		Запись.РабочийДокумент = Ссылка;
		Запись.Период = ТекущаяДата();
		Запись.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаНачата;
		Запись.Записать();
		
		Набор = РегистрыСведений.Renault_АвтосервисПланРабот.СоздатьНаборЗаписей();
		Набор.Отбор.Обращение.Установить(Обращение);
		Набор.Отбор.РабочийДокумент.Установить(Ссылка);
		Набор.Прочитать();
		
		НаборВремяНачала = ТекущаяДата();
		
		Если Не ЗначениеЗаполнено(Набор) Тогда
			
			#Если Клиент Тогда
			
			Если Вопрос("Документ незапланирован. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
				
				Отказ = ИСТИНА;
				Возврат;
				
			КонецЕсли;
			
			#КонецЕсли
			
		Иначе
			
			НаборВремяНачала = Набор[0].ВремяНачала;
			
		КонецЕсли;
		
		ОтставаниеВоВремени = ТекущаяДата() - НаборВремяНачала;
		
		НаборПланОперативный = РегистрыСведений.Renault_АвтосервисПланОперативный.СоздатьНаборЗаписей();
		НаборПланОперативный.Отбор.РабочийДокумент.Установить(ЭтотОбъект.Ссылка);
		НаборПланОперативный.Отбор.Обращение.Установить(Обращение);
		НаборПланОперативный.Прочитать();
		НаборПланОперативный.Очистить();
		
		// запишем все автоработы
		СтрокаГрафика = ЭтотОбъект.ДилерскийЦентр.АвтосервисГрафикРабот.Найти(ДеньНедели(Дата), "ДеньНедели");
		НачалоРабочегоДня = СтрокаГрафика.НачалоРабочегоДня;
		КонецРабочегоДня = СтрокаГрафика.КонецРабочегоДня;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_АвтосервисПланРабот.ВремяНачала,
		|	Renault_АвтосервисПланРабот.ВремяОкончания,
		|	Renault_АвтосервисПланРабот.ЭтапРабот,
		|	Renault_АвтосервисПланРабот.Цех,
		|	Renault_АвтосервисПланРабот.Длительность,
		|	Renault_АвтосервисПланРабот.РабочийДокумент
		|ИЗ
		|	РегистрСведений.Renault_АвтосервисПланРабот КАК Renault_АвтосервисПланРабот
		|ГДЕ
		|	Renault_АвтосервисПланРабот.Обращение = &Обращение
		|	И Renault_АвтосервисПланРабот.РабочийДокумент = &РабочийДокумент";
		Запрос.УстановитьПараметр("РабочийДокумент", ЭтотОбъект.Ссылка);
		Запрос.УстановитьПараметр("Обращение", Обращение);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Запись = НаборПланОперативный.Добавить();
			Запись.ДилерскийЦентр = ДилерскийЦентр;
			Запись.Период = ТекущаяДата();
			Запись.Обращение = Обращение;
			Запись.РабочийДокумент = Выборка.РабочийДокумент;
			Запись.ЭтапРабот = Выборка.ЭтапРабот;
			Запись.Цех = Выборка.Цех;
			Если Выборка.РабочийДокумент = Ссылка Тогда
				Запись.ВремяНачала = Выборка.ВремяНачала + ОтставаниеВоВремени;
				Запись.ВремяОкончания = Выборка.ВремяОкончания + ОтставаниеВоВремени;
			Иначе
				Запись.ВремяНачала = Выборка.ВремяНачала;
				Запись.ВремяОкончания = Выборка.ВремяОкончания;
			КонецЕсли;
			//Длительность = Выборка.ВремяОкончания - Выборка.ВремяНачала;
			//Запись.ВремяОкончания = Запись.ВремяНачала + Длительность;
			Длительность = Выборка.Длительность;
			Запись.Длительность = Выборка.Длительность;
			
		КонецЦикла;
		
		НаборПланОперативный.Записать();
		
		//Запишем занятость сотрудника
		
		Длительность = ЭтотОбъект.ДилерскийЦентр.ДлительностьПриемки*60;
		Сотрудник = ЭтотОбъект.Машиноместо;
		
		Запись = РегистрыСведений.CRM_СтатусыЗанятостиСотрудников.СоздатьМенеджерЗаписи();
		Запись.Сотрудник = Машиноместо;
		Запись.Статус = Перечисления.CRM_ЗанятостьСотрудника.Занят;
		Запись.Период = ТекущаяДата();
		Запись.ПричинаЗанятости = Перечисления.CRM_ПричиныЗанятостиСотрудника.Приемка;
		
		Если ЗначениеЗаполнено(ЭтотОбъект.ВремяОкончания) Тогда
			
			Запись.ПримерноеВремяОкончания = ТекущаяДата() + Длительность;
			
		Иначе
			
			Запись.ПримерноеВремяОкончания = ТекущаяДата() + Длительность;
			
		КонецЕсли;
		
		Запись.Записать();
		
	ИначеЕсли Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Выполнен Тогда
		
		Запись = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьМенеджерЗаписи();
		Запись.ДилерскийЦентр = ДилерскийЦентр;
		//Запись.ДатаВремяИзменения = ТекущаяДата();
		Запись.Обращение = Обращение;
		Запись.Цех = Машиноместо;
		Запись.ЭтапРабот = 1;
		Запись.РабочийДокумент = Ссылка;
		Запись.Период = ТекущаяДата();
		Запись.СтатусРаботы = Справочники.Renault_СтатусыАвторабот.РаботаЗакончена;
		Запись.Записать();
		
		НаборПлан = РегистрыСведений.Renault_АвтосервисПланОперативный.СоздатьНаборЗаписей();
		НаборПлан.Отбор.РабочийДокумент.Установить(Ссылка);
		НаборПлан.Прочитать();
		НаборПлан.Очистить();
		НаборПлан.Записать();
		
	//какой статус для "свободен" пока не придумал, пусть будет так:	
	//ИначеЕсли Состояние <> Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.ПриемкаНачата Тогда
		
		Запись = РегистрыСведений.CRM_СтатусыЗанятостиСотрудников.СоздатьМенеджерЗаписи();
		Запись.Сотрудник = Машиноместо;
		Запись.Статус = Перечисления.CRM_ЗанятостьСотрудника.Свободен;
		Запись.Период = ТекущаяДата();
		
		Запись.Записать();
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Автомобиль.VIN) И ЭтотОбъект.Автомобиль.VIN <> VIN Тогда
		
		VIN = ЭтотОбъект.Автомобиль.VIN;
		
		//ЭтотОбъект.Записать();
		
	КонецЕсли;
	
	// Воробьев Д.А. 06.10.2016 16:40:41 +++
	
	ЗафиксироватьСостояние = Ложь;
	
	Если Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.ПриемкаНачата
		И Не ПометкаУдаления Тогда
		
		ЗафиксироватьСостояние = Истина;
		мЭтап = 1;
		
	ИначеЕсли Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Выполнен
		И Не ПометкаУдаления Тогда
		
		ЗафиксироватьСостояние = Истина;
		мЭтап = 2;
		
	ИначеЕсли ПометкаУдаления Тогда
		УдалитьДвиженияПродажиСервиса(1);
		УдалитьДвиженияПродажиСервиса(2);
	КонецЕсли;
	
	Если ЗафиксироватьСостояние Тогда
	
		МассивЗаявок = НайтиСвязанныеЗаявкиНаСервис();
		
		Для каждого мЗаявкаНаСервис Из МассивЗаявок Цикл
		
			Запрос = Новый Запрос;
			
			Запрос.УстановитьПараметр("Сотрудник", Машиноместо);
			Запрос.УстановитьПараметр("ЗаявкаНаСервис", мЗаявкаНаСервис);
			Запрос.УстановитьПараметр("Этап", мЭтап);
			
			// Если есть заказ-наряд, то считаем его итоговым документом
			Если Не ЗначениеЗаполнено(мЗаявкаНаСервис.ЗаказНаряд) Тогда
				
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	Renault_CRM_ЗаявкаНаСервисРаботы.Работа КАК РаботаЗапчасть,
				|	СУММА(Renault_CRM_ЗаявкаНаСервисРаботы.Сумма) КАК Сумма,
				|	Renault_CRM_ЗаявкаНаСервисРаботы.Ссылка КАК ЗаявкаНаСервис,
				|	&Сотрудник КАК Сотрудник,
				|	&Этап КАК Этап,
				|	ИСТИНА КАК ЭтоРабота
				|ИЗ
				|	Документ.Renault_CRM_ЗаявкаНаСервис.Работы КАК Renault_CRM_ЗаявкаНаСервисРаботы
				|ГДЕ
				|	Renault_CRM_ЗаявкаНаСервисРаботы.Ссылка = &ЗаявкаНаСервис
				|
				|СГРУППИРОВАТЬ ПО
				|	Renault_CRM_ЗаявкаНаСервисРаботы.Работа,
				|	Renault_CRM_ЗаявкаНаСервисРаботы.Ссылка
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	Renault_CRM_ЗаявкаНаСервисТовары.Номенклатура,
				|	СУММА(Renault_CRM_ЗаявкаНаСервисТовары.Сумма),
				|	Renault_CRM_ЗаявкаНаСервисТовары.Ссылка,
				|	&Сотрудник,
				|	&Этап КАК Этап,
				|	ЛОЖЬ
				|ИЗ
				|	Документ.Renault_CRM_ЗаявкаНаСервис.Товары КАК Renault_CRM_ЗаявкаНаСервисТовары
				|ГДЕ
				|	Renault_CRM_ЗаявкаНаСервисТовары.Ссылка = &ЗаявкаНаСервис
				|
				|СГРУППИРОВАТЬ ПО
				|	Renault_CRM_ЗаявкаНаСервисТовары.Номенклатура,
				|	Renault_CRM_ЗаявкаНаСервисТовары.Ссылка";
				
			Иначе
				
				Запрос.УстановитьПараметр("ЗаказНаряд", мЗаявкаНаСервис.ЗаказНаряд);
				
				Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗаказНарядТовары.Номенклатура КАК РаботаЗапчасть,
				|	СУММА(ЗаказНарядТовары.СуммаВсего) КАК Сумма,
				|	&Сотрудник КАК Сотрудник,
				|	&Этап КАК Этап,
				|	&ЗаявкаНаСервис,
				|	ЛОЖЬ КАК ЭтоРабота
				|ИЗ
				|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
				|ГДЕ
				|	ЗаказНарядТовары.Ссылка = &ЗаказНаряд
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаказНарядТовары.Номенклатура
				|
				|ОБЪЕДИНИТЬ ВСЕ
				|
				|ВЫБРАТЬ
				|	ЗаказНарядРаботы.Работа,
				|	СУММА(ЗаказНарядРаботы.СуммаВсего),
				|	&Сотрудник,
				|	&Этап КАК Этап,
				|	&ЗаявкаНаСервис,
				|	ИСТИНА
				|ИЗ
				|	Документ.ЗаказНаряд.Работы КАК ЗаказНарядРаботы
				|ГДЕ
				|	ЗаказНарядРаботы.Ссылка = &ЗаказНаряд
				|
				|СГРУППИРОВАТЬ ПО
				|	ЗаказНарядРаботы.Работа";
				
			КонецЕсли;
			
			НаборЗаписейПродажиСервиса = РегистрыСведений.Renault_СоставРаботПоЭтапам.СоздатьНаборЗаписей();
			НаборЗаписейПродажиСервиса.Отбор.Этап.Установить(мЭтап);
			НаборЗаписейПродажиСервиса.Отбор.ЗаявкаНаСервис.Установить(мЗаявкаНаСервис);
			НаборЗаписейПродажиСервиса.Прочитать();
			НаборЗаписейПродажиСервиса.Очистить();
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Запись = НаборЗаписейПродажиСервиса.Добавить();
				ЗаполнитьЗначенияСвойств(Запись, Выборка);
				
				Запись.Дата = ?(ЗначениеЗаполнено(ВремяНачала), ВремяНачала, ТекущаяДатаСеанса());
			КонецЦикла;
			
			НаборЗаписейПродажиСервиса.Записать();
				
		КонецЦикла;
		
	КонецЕсли;	
	// Воробьев Д.А. 06.10.2016 14:34:13 --- 
	
	//Если ЗначениеЗаполнено(ДилерскийЦентр) И ДилерскийЦентр.Автосервис_ИспользуетсяПланшет_v2 Тогда
	//	СостоянияДляВыгрузкиВПланшет = Renault_АвтосервисСервер.ПолучитьДопустимыеСостоянияПриемки();
	//	Если Не(СостоянияДляВыгрузкиВПланшет.Найти(Состояние) = Неопределено) Тогда
	//		МенеджерЗаписей = РегистрыСведений.Renault_ОтправкаПриемкиВПланшет.СоздатьМенеджерЗаписи();
	//		МенеджерЗаписей.Приемка = Ссылка;
	//		МенеджерЗаписей.Отправлена = Ложь;
	//		МенеджерЗаписей.ТекстОшибки = "Установлена в очередь на отправку";
	//		МенеджерЗаписей.Записать();
	//		
	//		//Выполним фоновую отправку приемки
	//		ПараметрыФЗ = Новый Массив;
	//		ПараметрыФЗ.Добавить(Ссылка);
	//		ФоновыеЗадания.Выполнить("Renault_АвтосервисСерверСинхрСПланшетом.ВыгрузитьПриемкуВПланшет",ПараметрыФЗ,Строка(Новый УникальныйИдентификатор),"Renault_АвтосервисСерверСинхрСПланшетом.ВыгрузитьПриемкуВПланшет");
	//		//Renault_АвтосервисСерверСинхрСПланшетом.ВыгрузитьПриемкуВПланшет(Ссылка);
	//	КонецЕсли;
	//КонецЕсли;

	
КонецПроцедуры



// Воробьев Д.А. 06.10.2016 16:55:48 +++

Функция НайтиСвязанныеЗаявкиНаСервис()

	МассивЗаявок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Renault_CRM_ЗаявкаНаСервис.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Renault_CRM_ПриемкаАвтомобиля КАК Renault_CRM_ПриемкаАвтомобиля
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
	               |		ПО Renault_CRM_ПриемкаАвтомобиля.Обращение = Renault_CRM_ЗаявкаНаСервис.Обращение
	               |			И (Renault_CRM_ПриемкаАвтомобиля.Ссылка = &Ссылка
	               |				И НЕ Renault_CRM_ЗаявкаНаСервис.ПометкаУдаления)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ссылка УБЫВ
	               |АВТОУПОРЯДОЧИВАНИЕ";
				   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивЗаявок.Добавить(Выборка.Ссылка);	
	КонецЦикла;

	Возврат МассивЗаявок;
	
КонецФункции // НайтиСвязаннуюЗаявкуНаСервис()

Процедура ПередУдалением(Отказ)
	УдалитьДвиженияПродажиСервиса(1);
	УдалитьДвиженияПродажиСервиса(2);
КонецПроцедуры

Процедура УдалитьДвиженияПродажиСервиса(Этап)

	Заявки = НайтиСвязанныеЗаявкиНаСервис();
	
	Для каждого ЭлЗаявка Из Заявки Цикл
	
		НаборЗаписейПродажиСервиса = РегистрыСведений.Renault_СоставРаботПоЭтапам.СоздатьНаборЗаписей();
		НаборЗаписейПродажиСервиса.Отбор.Этап.Установить(Этап);
		НаборЗаписейПродажиСервиса.Отбор.ЗаявкаНаСервис.Установить(ЭлЗаявка);
		НаборЗаписейПродажиСервиса.Прочитать();
		НаборЗаписейПродажиСервиса.Очистить();
		НаборЗаписейПродажиСервиса.Записать();		
	
	КонецЦикла;

КонецПроцедуры

// Воробьев Д.А. 06.10.2016 16:55:48 --- 

Процедура ОбработкаУдаленияПроведения(Отказ)Экспорт
	
	Движения.Renault_ПоврежденияАвтомобилей.Очистить();
	Движения.Записать();
	
КонецПроцедуры

Функция ОчиститьПланПоКлиенту(Обращение) Экспорт
	
	#Если Клиент Тогда
	
	Если ЗначениеЗаполнено(Обращение) Тогда
		
		СписокСтатусов = Новый СписокЗначений;
		СписокСтатусов.Добавить(Справочники.Renault_СтатусыАвторабот.РаботаЗапланирована);
		СписокСтатусов.Добавить(Справочники.Renault_СтатусыАвторабот.РаботаПросрочена);
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Renault_АвтосервисСтатусыРаботСрезПоследних.СтатусРаботы
		|ИЗ
		|	РегистрСведений.Renault_АвтосервисСтатусыРабот.СрезПоследних(
		|			,
		|			Обращение = &ТекущееОбращение
		|				) КАК Renault_АвтосервисСтатусыРаботСрезПоследних";
		Запрос.УстановитьПараметр("ТекущееОбращение", Обращение);
		Запрос.УстановитьПараметр("СписокСтатусов", СписокСтатусов);
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			
			Ответ = Вопрос("Вы уверены что хотите удалить планирование по текущему клиенту?", РежимДиалогаВопрос.ДаНет);
			Если Ответ = КодВозвратаДиалога.Да Тогда
				
				НаборПлан = РегистрыСведений.Renault_АвтосервисПланРабот.СоздатьНаборЗаписей();
				НаборПлан.Отбор.Обращение.Установить(Обращение);
				НаборПлан.Прочитать();
				НаборПлан.Очистить();
				НаборПлан.Записать();
				
				НаборСтатусы = РегистрыСведений.Renault_АвтосервисСтатусыРабот.СоздатьНаборЗаписей();
				НаборСтатусы.Отбор.Обращение.Установить(Обращение);
				НаборСтатусы.Прочитать();
				НаборСтатусы.Очистить();
				НаборСтатусы.Записать();
				
				НаборПланОп = РегистрыСведений.Renault_АвтосервисПланОперативный.СоздатьНаборЗаписей();
				НаборПланОп.Отбор.Обращение.Установить(Обращение);
				НаборПланОп.Прочитать();
				НаборПланОп.Очистить();
				НаборПланОп.Записать();
				
				НаборФактОп = РегистрыСведений.Renault_АвтосервисФактОперативный.СоздатьНаборЗаписей();
				НаборФактОп.Отбор.Обращение.Установить(Обращение);
				НаборФактОп.Прочитать();
				НаборФактОп.Очистить();
				НаборФактОп.Записать();
				
				ПустаяДата = '00010101';
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	Renault_CRM_ПриемкаАвтомобиля.Ссылка
				|ИЗ
				|	Документ.Renault_CRM_ПриемкаАвтомобиля КАК Renault_CRM_ПриемкаАвтомобиля
				|ГДЕ
				|	Renault_CRM_ПриемкаАвтомобиля.Обращение = &Обращение";
				Запрос.УстановитьПараметр("Обращение", Обращение);
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					ОбъектДок = Выборка.Ссылка.ПолучитьОбъект();
					ОбъектДок.ВремяНачала = ПустаяДата;
					ОбъектДок.ВремяОкончания = ПустаяДата;
					ОбъектДок.Машиноместо = Справочники.Сотрудники.ПустаяСсылка();
					ОбъектДок.Записать();
				КонецЦикла;
				
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	Renault_CRM_ВыдачаАвтомобиля.Ссылка
				|ИЗ
				|	Документ.Renault_CRM_ВыдачаАвтомобиля КАК Renault_CRM_ВыдачаАвтомобиля
				|ГДЕ
				|	Renault_CRM_ВыдачаАвтомобиля.Обращение = &Обращение";
				Запрос.УстановитьПараметр("Обращение", Обращение);
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					ОбъектДок = Выборка.Ссылка.ПолучитьОбъект();
					ОбъектДок.ВремяНачала = ПустаяДата;
					ОбъектДок.ВремяОкончания = ПустаяДата;
					ОбъектДок.Машиноместо = Справочники.Сотрудники.ПустаяСсылка();
					ОбъектДок.Записать();
				КонецЦикла;
				
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	Renault_CRM_ЗаявкаНаМойку.Ссылка
				|ИЗ
				|	Документ.Renault_CRM_ЗаявкаНаМойку КАК Renault_CRM_ЗаявкаНаМойку
				|ГДЕ
				|	Renault_CRM_ЗаявкаНаМойку.Обращение = &Обращение";
				Запрос.УстановитьПараметр("Обращение", Обращение);
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					ОбъектДок = Выборка.Ссылка.ПолучитьОбъект();
					ОбъектДок.ВремяНачала = ПустаяДата;
					ОбъектДок.ВремяОкончания = ПустаяДата;
					ОбъектДок.Машиноместо = Справочники.Renault_CRM_Мойки.ПустаяСсылка();
					ОбъектДок.Записать();
				КонецЦикла;
				
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|	Renault_CRM_ЗаявкаНаСервис.Ссылка
				|ИЗ
				|	Документ.Renault_CRM_ЗаявкаНаСервис КАК Renault_CRM_ЗаявкаНаСервис
				|ГДЕ
				|	Renault_CRM_ЗаявкаНаСервис.Обращение = &Обращение";
				Запрос.УстановитьПараметр("Обращение", Обращение);
				Выборка = Запрос.Выполнить().Выбрать();
				Пока Выборка.Следующий() Цикл
					ОбъектДок = Выборка.Ссылка.ПолучитьОбъект();
					ОбъектДок.ВремяНачала = ПустаяДата;
					ОбъектДок.ВремяОкончания = ПустаяДата;
					Для Каждого СтрокаРаботы ИЗ ОбъектДок.Работы Цикл
						СтрокаРаботы.ВремяНачала = ПустаяДата;
						СтрокаРаботы.ВремяОкончания = ПустаяДата;
						СтрокаРаботы.Машиноместо = Справочники.Цеха.ПустаяСсылка();
					КонецЦикла;
					ОбъектДок.Записать();
				КонецЦикла;
				
				Если Вопрос("Клиент упущен?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				
					Возврат Истина
				
				Иначе
			
					Возврат Ложь;
			
				КонецЕсли;

				
			КонецЕсли;
			
		Иначе
			Предупреждение("План по обращению отсутствует" + Символы.ПС + "или по данному обращению нельзя изменять планирование.");
			
			Если Вопрос("Клиент упущен?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				
				Возврат Истина
				
			Иначе
			
				Возврат Ложь;
			
			КонецЕсли;
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
	#КонецЕсли

	
КонецФункции

//функция, возвращает значение НЕ ОтменилЗапись
Функция ОтменилЗапись() Экспорт
	
	#Если Клиент Тогда
	Если ЭтотОбъект.Состояние <> Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Выполнен Тогда
		
		Если Вопрос("Внимание! Будут удален весь планнинг по клиенту!", РежимДиалогаВопрос.ОКОтмена) = КодВозвратаДиалога.ОК Тогда
			
			Если ЗначениеЗаполнено(ЭтотОбъект.Обращение) Тогда
				
				ОбращениеОбъект = ЭтотОбъект.Обращение.Ссылка.ПолучитьОбъект();
				
			Иначе
				
				Предупреждение("Обращение по приемке не найдено или было удалено.");
				Возврат ИСТИНА; 
				
			КонецЕсли;
			
			Если ОчиститьПланПоКлиенту(ЭтотОбъект.Обращение) = ИСТИНА Тогда
				
				Форма = ПолучитьОбщуюФорму("Renault_ФормаВыбораПлиткой");
				Форма.Заголовок = "Выберите причину упущения обращения";
				СписокВыбора = Новый СписокЗначений;
				Выборка = Справочники.Renault_ПричиныУпущенияОбращенийАвтосервис.Выбрать();
				Пока Выборка.Следующий() Цикл
					СписокВыбора.Добавить(Выборка.Ссылка);
				КонецЦикла;
				Форма.СписокВыбора = СписокВыбора;
				Форма.ЗапретЗакрытияБезВыбора = истина; // DMSREN-1062
				
				Ответ = Форма.ОткрытьМодально();
				
				Объект = ЭтотОбъект.Ссылка.ПолучитьОбъект();
				Объект.Состояние = Справочники.Renault_ВидыСостоянийДокументовАвтосервиса.Отмена;
				Объект.ВремяОкончания = '00010101';
				Объект.Записать();
				
				ОбращениеОбъект = Обращение.Ссылка.ПолучитьОбъект();
				ОбращениеОбъект.ОтменилЗапись = Истина;
				ОбращениеОбъект.Упущено = ИСТИНА;
				ОбращениеОбъект.ПричинаУпущения = Ответ;
				ОбращениеОбъект.Записать();
				
				Возврат ЛОЖЬ;
				
			КонецЕсли;
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;
	Иначе
		
		Вопрос("Статус работ не повзовляет отменить запись клиента.", РежимДиалогаВопрос.ОК);
		Возврат ИСТИНА;
		
	КонецЕсли;
	
	#КонецЕсли
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)  	
	Если ОбменДанными.Загрузка Тогда 		
		Возврат;  		
	КонецЕсли;
	
	//Если НЕ Ссылка.Пустая() И ДилерскийЦентр.Автосервис_ИспользуетсяПланшет_v2 и Ссылка.ВремяНачала <> ВремяНачала или Ссылка.ВремяОкончания <> ВремяОкончания Тогда
	//	// если изменилась плановая дата, то запишем в очередь на отправку в планшет
	//	МенеджерЗаписей = РегистрыСведений.Renault_ОтправкаПриемкиВПланшет.СоздатьМенеджерЗаписи();
	//	МенеджерЗаписей.Приемка = Ссылка;
	//	МенеджерЗаписей.Отправлена = Ложь;
	//	МенеджерЗаписей.ТекстОшибки = "Установлена в очередь на отправку";
	//	МенеджерЗаписей.Записать();
	//	
	//	//Выполним фоновую отправку приемки
	//	ПараметрыФЗ = Новый Массив;
	//	ПараметрыФЗ.Добавить(Ссылка);
	//	ФоновыеЗадания.Выполнить("Renault_АвтосервисСерверСинхрСПланшетом.ВыгрузитьПриемкуВПланшет",ПараметрыФЗ,,"Renault_АвтосервисСерверСинхрСПланшетом.ВыгрузитьПриемкуВПланшет");
	//	
	//КонецЕсли;
	
КонецПроцедуры
